interface FAQItem {
  question: string;
  answer: string;
}

export const FAQ: FAQItem[] = [
  {
    question: 'KUIT은 어떤 동아리인가요?',
    answer:
      'KUIT(쿠잇)은 ‘KU can do IT’의 약자로, 웹과 앱 서비스 제작을 목표로 하는 건국대학교 IT 기획 및 개발 동아리입니다. 학기 중에는 기획(PM), 웹, 서버, 안드로이드, 디자인 등 각 파트별로 필요한 기술을 깊이 있게 스터디하고, 이를 바탕으로 방학 기간에는 실제 서비스를 기획부터 개발까지 완료해보는 프로젝트를 진행하여 부원 모두가 IT 전문가로 성장하는 것을 목표로 합니다.',
  },
  {
    question: 'KUIT의 지원 자격은 어떻게 되나요? (재학생, 휴학생, 졸업예정 등)',
    answer:
      '건국대학교 학생이라면 누구나 지원 가능합니다. 특정 학적 상태(재학, 휴학, 졸업 유예 등)에 대한 제한보다는, 웹/앱 서비스 제작이라는 분명한 목표를 가지고 한 학기 동안 열정적으로 공부하며 끝까지 활동을 완주할 수 있는 분이라면 누구든 환영합니다!',
  },
  {
    question: '어느 정도의 개발 실력이 요구되나요?',
    answer:
      'KUIT은 이미 완성된 실력을 갖춘 사람뿐만 아니라, 배우고자 하는 열정이 가득한 분들을 기다립니다. 학기 중에 파트별로 필요한 기술들에 대한 체계적인 스터디가 진행되기 때문에, 현재의 실력보다는 한 학기 동안 열심히 공부해서 참여한 파트를 확실히 끝내겠다는(QUIT) 끈기와 열정이 있다면 충분히 지원하실 수 있습니다.',
  },
  {
    question: '스터디 정기 모임은 언제인가요?',
    answer:
      '스터디는 총 9주 동안 일주일에 한 번씩 조를 이루어 조별로 진행됩니다. 모집 후 조 편성이 이루어지면, 스터디 정기 모임 일자는 조별로 유동적으로 조율하여 확정할 수 있습니다.',
  },
  {
    question: 'KUIT 방학 중 프로젝트는 필수 참여인가요?',
    answer:
      '네, 그렇습니다. KUIT의 핵심 커리큘럼은 학기 중에 배운 지식을 바탕으로 방학 동안 실제 서비스를 만들어보는 것에 있습니다. 기획자, 디자이너, 개발자가 협업하여 결과물을 만들어내는 이 과정이야말로 실질적인 성장을 이루는 시간이기 때문에, 방학 프로젝트까지 성실히 참여하셔야 KUIT 활동 수료가 가능합니다.',
  },
];
